html/docker/kubernates-handbook/theory/architecture/etcd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Etcd</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="design.html"> UP </a>
 |
 <a accesskey="H" href="architecture.html"> HOME </a>
</div><div id="content">
<h1 class="title">Etcd</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8ecc0b1">原理</a></li>
<li><a href="#orgfcafbff">存储Flannel网络信息</a></li>
<li><a href="#org23582ae">存储Kubernetes对象信息</a>
<ul>
<li><a href="#orgcaf634f">查看集群中所有的Pod信息</a></li>
</ul>
</li>
<li><a href="#orga19f841">Etcd V2与V3版本API的区别</a></li>
<li><a href="#org92d4851">Etcd数据备份</a></li>
</ul>
</div>
</div>
<p>
Etcd是Kubernetes集群中的一个十分重要的组件，用于 <b>保存</b> 集群所有的网络配置和对象的状态信息。整个kubernetes系统中一共有两个服务需要用到etcd用来协同和存储配置，分别是：
</p>
<ul class="org-ul">
<li>网络插件flannel、对于其它网络插件也需要用到etcd存储 <span class="underline">网络</span> 的配置信息</li>
<li>kubernetes本身，包括各种 <span class="underline">对象的状态</span> 和 <span class="underline">元信息</span> 配置</li>
</ul>

<pre class="example" id="org722b591">
flannel操作etcd使用的是v2的API，而kubernetes操作etcd使用的v3的API

所以在下面执行etcdctl的时候需要设置ETCDCTL_API环境变量，该变量默认值为2
</pre>
<div id="outline-container-org8ecc0b1" class="outline-2">
<h2 id="org8ecc0b1">原理</h2>
<div class="outline-text-2" id="text-org8ecc0b1">
<p>
Etcd使用的是 <span class="underline">raft</span> 一致性算法来实现的，是一款分布式的一致性KV存储，主要用于 <span class="underline">共享配置</span> 和 <span class="underline">服务发现</span> 
</p>
</div>
</div>
<div id="outline-container-orgfcafbff" class="outline-2">
<h2 id="orgfcafbff">存储Flannel网络信息</h2>
<div class="outline-text-2" id="text-orgfcafbff">
<p>
在安装Flannel的时候配置了 <span class="underline">FLANNEL_ETCD_PREFIX="/kube-centos/network"</span> 参数，这是Flannel查询etcd的目录地址。查看Etcd中存储的flannel网络信息：
</p>

<div class="org-src-container">
<pre class="src src-sh">$ etcdctl --ca-file=/etc/kubernetes/ssl/ca.pem --cert-file=/etc/kubernetes/ssl/kubernetes.pem <span style="color: #deb887;">\</span>
  --key-file=/etc/kubernetes/ssl/kubernetes-key.pem ls /kube-centos/network -r

2018-01-19 18:38:22.768145 I | warning: ignoring ServerName for user-provided CA for backwards compatibility is deprecated
/kube-centos/network/config
/kube-centos/network/subnets
/kube-centos/network/subnets/172.30.31.0-24
/kube-centos/network/subnets/172.30.20.0-24
/kube-centos/network/subnets/172.30.23.0-24
</pre>
</div>

<p>
查看flannel的配置：
</p>
<div class="org-src-container">
<pre class="src src-sh">$ etcdctl --ca-file=/etc/kubernetes/ssl/ca.pem --cert-file=/etc/kubernetes/ssl/kubernetes.pem <span style="color: #deb887;">\</span>
  --key-file=/etc/kubernetes/ssl/kubernetes-key.pem get /kube-centos/network/config

2018-01-19 18:38:22.768145 I | warning: ignoring ServerName for user-provided CA for backwards compatibility is deprecated
{ <span style="color: #deb887;">"Network"</span>: <span style="color: #deb887;">"172.30.0.0/16"</span>, <span style="color: #deb887;">"SubnetLen"</span>: 24, <span style="color: #deb887;">"Backend"</span>: { <span style="color: #deb887;">"Type"</span>: <span style="color: #deb887;">"host-gw"</span> } }
</pre>
</div>
</div>
</div>
<div id="outline-container-org23582ae" class="outline-2">
<h2 id="org23582ae">存储Kubernetes对象信息</h2>
<div class="outline-text-2" id="text-org23582ae">
<p>
Kubernetes使用etcd v3的API操作etcd中的数据。所有的资源对象都保存在 <span class="underline">/registry</span> 路径下，如下：
</p>

<pre class="example" id="org3d42867">
ThirdPartyResourceData
apiextensions.k8s.io
apiregistration.k8s.io
certificatesigningrequests
clusterrolebindings
clusterroles
configmaps
controllerrevisions
controllers
daemonsets
deployments
events
horizontalpodautoscalers
ingress
limitranges
minions
monitoring.coreos.com
namespaces
persistentvolumeclaims
persistentvolumes
poddisruptionbudgets
pods
ranges
replicasets
resourcequotas
rolebindings
roles
secrets
serviceaccounts
services
statefulsets
storageclasses
thirdpartyresources
</pre>

<p>
如果你还创建了CRD（自定义资源定义），则在此会出现CRD的API 
</p>
</div>
<div id="outline-container-orgcaf634f" class="outline-3">
<h3 id="orgcaf634f">查看集群中所有的Pod信息</h3>
<div class="outline-text-3" id="text-orgcaf634f">
<p>
例如直接从etcd中查看kubernetes集群中所有的pod的信息，可以使用下面的命令：
</p>

<div class="org-src-container">
<pre class="src src-sh">$ <span style="color: #4eee94;">ETCDCTL_API</span>=3 etcdctl get /registry/pods --prefix -w json|python -m json.tool
</pre>
</div>

<p>
此时将看到json格式输出的结果，其中的key使用了base64编码
</p>
</div>
</div>
</div>
<div id="outline-container-orga19f841" class="outline-2">
<h2 id="orga19f841">Etcd V2与V3版本API的区别</h2>
<div class="outline-text-2" id="text-orga19f841">
<p>
Etcd V2和V3之间的数据结构完全不同，互不兼容，也就是说使用V2版本的API创建的数据只能使用V2的API访问，V3的版本的API创建的数据只能使用V3的API访问
</p>

<pre class="example" id="org1eb9072">
这就造成访问etcd中保存的flannel的数据需要使用etcdctl的V2版本的客户端，而访问kubernetes的数据需要设置ETCDCTL_API=3环境变量来指定V3版本的API
</pre>
</div>
</div>
<div id="outline-container-org92d4851" class="outline-2">
<h2 id="org92d4851">Etcd数据备份</h2>
<div class="outline-text-2" id="text-org92d4851">
<p>
安装的时候指定的Etcd数据的存储路径是 <span class="underline">/var/lib/etcd</span> ，一定要对该目录做好备份 
</p>

<p>
<a href="interface.html">Next：接口</a>
</p>

<p>
<a href="design.html">Previous：设计</a>
</p>

<p>
<a href="architecture.html">Home：架构</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
